mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/at_command.c
#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include "NUC100Series.h"
#define osObjectsPublic										 // define objects in main module
#include "osObjects.h"											// RTOS object definitions
#include "uart.h"
#include "cmsis_os.h"							 // CMSIS RTOS header file

#include "WinboundFlash.h"
#include "preprocessor.h"
#include <math.h>

#define pi 3.14159265358979323846
//#define header              "HEADER"
//#define vendorID            "JFT"
//#define firmwareversion     "2.1.0"
//#define frameformat         "1.0.0"    
/*	Extern Variables
*****************************************************************/
extern char g_u8SendData[TXBUFSIZE];
extern char g_u8RecData[RXBUFSIZE];
extern	int32_t life;
extern void SendChar(int ch);
extern void send_OBD(char * command, char * response1, char * response2, char * response3, int32_t timeout);
extern volatile int interval_count_health;
volatile int sleepinterval_health=2;
volatile int wakeinterval_emer;
char SrcArray[257];
char DestArray[257];
extern char configdata[300];
uint8_t sendfs=0;
extern void Open_SPI_Flash(void);
extern unsigned int SpiFlash_ReadMidDid(void);
float readpt = 256;
extern int once;
extern float pt;
int loginpacket = 0;
int cregretry = 0;
float speed;
int messagecounter;
extern int simselect;
uint8_t alertid = 0;
extern uint32_t crc32_fsl(uint32_t crc, const uint8_t *buf, uint32_t len);
/****************************************************************/
extern volatile int ignitionhighlow;
extern volatile int emergencyhighlow;
extern float overspeed;
extern char obdresp[20];
char cregresp[10];
extern char tempobdresp[20];
extern char obdrespbinary[33];
extern char suppportedpid[100][7];
extern int pidcounter;
extern char g_u8OBDRecData[OBDRXBUFSIZE];
extern int saveipconfigurations(void);
extern char vehicleregnum[15];
char lastlocation[50];
char signalquality[5] = {0};
char emernum1[15] = {0};
char emernum2[15] = {0};
extern volatile uint32_t wetmr;
extern volatile int notsentcounter;
extern osThreadId tid_Thread_accgyro_READ;
  int sleepinterval;
__inline void remove_all_alpha(char* str, char c, char d);
volatile uint8_t timeoutflag = 0 ;
/** Packet*****************************************/
  int tcpsendchtimer;
  int powerstatus = 0;
  volatile int ignition = 0;
  volatile int emergencystatus = 0;  
  int fix = 0;
  float int_bat_per;
  int int_bat_thresh;
  float mem_per;
  static int d1,d2;
  int iz;
  double a,b,c;int hh,mm1,mm2;
  double a1,b1,c1;
  double hh11, mm11,mm22;
  volatile char tamperalert = 'C';
  float ext_bat, int_bat, lati, longi, speed;
  float analog1,analog2,analog3,analog4;

  float antennafeedback = 0;
  float batteryvoltage = 0;
  float inputvoltage = 0;
  char latitude[12] = 0;
  char longitude[12] = 0;
  char prevlatitude[12] = 0;
  char prevlongitude[12] = 0;
  char gpsdate[7] = 0;
  char gpstime[7] = 0;
  char kmph[6] = 0;
  char heading[8] = 0;
  char alt[8] = 0;
  char sat[3] = 0;
  char latdir[2] = 0;
  char longdir[2] = 0;
  char hdop[6] = 0;
  char pdop[5] = 0;
  char networkoperator[30] = 0;
  char mcc[5] = 0;
  char mnc[5] = 0;
  char lac[5] = 0;
  char cellid[10] = 0;
  char packetstatus = 'L';
  char nmr[200] = 0;
  extern volatile uint8_t input1, input2, input3, input4;
  extern char apn[20];
  extern volatile int parameterupgrade;
  int outfromloop = 0;


/*	Global Variables
*****************************************************************/
int32_t	inc=0;
int stlen;
uint8_t u8InChar=0xFF;
volatile int pushemergency=0;
volatile int32_t g_u8RecDataptr=0;
float	u32ADC0Result;
float u32ADC0Result1;
float batteryvoltagethreshold;
int8_t charging, cpinready, cregready;
int motion_counts,immotion_counts;
volatile int32_t timer0ticks=0;
volatile int32_t tmr0sec=0;
char * r1;
char * r2;
char * r3;
char temp[100];
char fileinstance[20] = {0};
int8_t  network = 1;
int breaker=0;
int seeker = 0;
int imeiptr0=0;
char imei[25];
int imeiptr=0;
	int tcpdatalength=0;
	int32_t tcpdataptr=0;
	int times = 0;
	int timesptr=0;
	int tdp=0;
  int read_obd = 0 ;
	int tdpend=300;
/****************************************************************/
//extern osMutexDef (uart_mutex);		// Declare mutex
extern osMutexId	(uart_mutex_id); // Mutex ID
		
//extern osMutexDef (tcp_mutex);		// Declare mutex
extern osMutexId	(tcp_mutex_id); // Mutex ID
extern unsigned int xcrc32 (const unsigned char *buf, int len, unsigned int init);
//extern osMutexDef (fs_mutex);		// Declare mutex
extern osMutexId	(fs_mutex_id); // Mutex ID		
extern volatile int interval_count;
extern volatile int g_u32AdcIntFlag;
volatile int sleepinterval_i1;
volatile int sleepinterval_i0;

/*	Function Declarations
*****************************************************************/
void SendAT(char * command, char * response1, char * response2, char * response3, int32_t timeout);
void SendAT_FS(char * command, char * response1, char * response2, char * response3, int32_t timeout);
void TCP_Send_ch(char * tcpcommand,char * tcpdataq, char * tcpresponse1, char * tcpresponse2, char * tcpresponse3, int32_t tcptimeout);
void SendAT_GPS_WO_MUTEX(char * command, char * response1, char * response2, char * response3, int32_t timeout);
void TCP_Send_ch(char * tcpcommand,char * tcpdataq, char * tcpresponse1, char * tcpresponse2, char * tcpresponse3, int32_t tcptimeout);
void TCP_Send(char * tcpcommand,char * tcpdata, char * tcpresponse1, char * tcpresponse2, char * tcpresponse3, int32_t tcptimeout);

void clear(void);
extern void readaccgyrodata(void);
__inline void manualdelay(int delayms);
__inline void fileclose(void);  
__inline void fileopen(void);
__inline void parse_g(char* str, int first, int sec, char f, char s , char *string);
__inline void remove_all_chars(char* str, char c, char d);
__inline void manualdelay(int delayms);
__inline void strreplace(char s[], char chr, char repl_chr);

void cregquerry(void);
void cpinquerry(void);
void Save_FS(void);
char *response1;
char *response2;
char *response3;
double deg2rad(double);
double rad2deg(double);

double distance(double lat1, double lon1, double lat2, double lon2, char unit) {
  double theta, dist;
  theta = lon1 - lon2;
  dist = sin(deg2rad(lat1)) * sin(deg2rad(lat2)) + cos(deg2rad(lat1)) * cos(deg2rad(lat2)) * cos(deg2rad(theta));
  dist = acos(dist);
  dist = rad2deg(dist);
  dist = dist * 60 * 1.1515;
  switch(unit) {
    case 'M':
      break;
    case 'K':
      dist = dist * 1.609344;
      break;
    case 'N':
      dist = dist * 0.8684;
      break;
  }
  return (dist);
}

double deg2rad(double deg) {
  return (deg * pi / 180);
}


double rad2deg(double rad) {
  return (rad * 180 / pi);
}

void SendAT(char * command, char * res1, char * res2, char * res3, int32_t timeout)
{
  static int attry;
  response1 = res1;
  response2 = res2;
  response3 = res3;
  dtr = 0;
  timeoutflag =  0;
	tmr0sec=0;
//	timeout =5;
	r1=0;
	r2=0;
	r3=0;
	g_u8RecDataptr=0;
	memset(g_u8RecData,0,RXBUFSIZE);
	printf("%c",0x1A);
	clear();
	printf(command);
	do{
    g_u8RecData[0] = '\r';
		r1 = strstr(g_u8RecData, response1);
		r2 = strstr(g_u8RecData, response2);
		r3 = strstr(g_u8RecData, response3);
    
	}while(!(r1 || r2 || r3 ||((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||

   if(!(strstr(command, "QILOCIP") || strstr(command, "QGNSSC")))
   {
     if(!(r1 || r2 || r3))
      {timeoutflag =  1;
        ///PA13=1;
        attry++;
        if(attry > 3){
            PB15 = 0;
            manualdelay(1);
            PB15 = 1;
            manualdelay(100);      
            SendAT("\r\nAT\r\n", "ERROR", "OK" , "4010",10);
            manualdelay(200);
        }
        ///PA13=0;
      }
      else{attry=0;}
   }
   dtr = 1;
osSignalSet (tid_Thread_accgyro_READ, 0x0001);    // set the signal 0x0001 for thread tid_thread1
}

