mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/at_command.c
 void manualdelay(int delayms)
{
  dtr = 0;
	for(d1 = 0; d1 < delayms ; d1++)
	{
		for(d2=0; d2 < 65535; d2++)
		{//printf("\n");
		}
	}
  dtr = 1;
}
char mystrstr(char* str1, char character)
{int sz,cn;
  sz=strlen(str1);
	for(cn=0;cn<=sz;cn++)
	{if(str1[cn] == character)
		{return 1;}
	}
	return 0;
}
__inline void fileopen(void)
{
  if(strlen(fileinstance) == 0)
  {
    SendAT("\r\nAT+QFOPEN=\"LOG.TXT\",0\r\n", "Ready", "OK" , "ERROR",10);	
    if(strstr(g_u8RecData,"CME ERROR"))
    {
        PA13=1;
        printf("\r\n\r\nAT+CFUN=1,1\r\n\r\n");
        manualdelay(100);
        PA13=0;
        memset(fileinstance,0,20);
    SendAT("\r\nAT+QFOPEN=\"LOG.TXT\",0\r\n", "Ready", "OK" , "ERROR",10);	
    }
    parse_g(g_u8RecData, 1, 2, ' ', '\n' , fileinstance);
    remove_all_chars(fileinstance, '\r', '\n');   
    SendAT("\r\nAT+QGNSSC=1\r\n\r\n", "OK", "ERROR", "7103", 5);
  }
}

__inline void remove_all_chars(char* str, char c, char d) {
    char *pr = str, *pw = str;
    while (*pr) {
        *pw = *pr++;
			pw += (*pw != c && *pw != d);
    }
    *pw = '\0';
}



// && *pw != ' ' && *pw != '/' && *pw != ':'

void parse_g(char* str, int first, int sec, char f, char s , char *string)
{int sz1,sz2,i11,temp11,j11,l;
    if(mystrstr(str,f) && mystrstr(str,s))
    {  

		sz1=	strlen(str);
		sz2=	strlen(string);
		memset(string,0,sz2);
		for(i11=0,temp11=0;i11<sz1;i11++)
		{
		if(str[i11]==s)
			{
        temp11++;
        j11=i11;
      }
		else{}
			
		if(temp11>=sec){i11=9900;}
		else{}	
		
		}	
		
		for(i11=0,temp11=0;i11<sz1;i11++)
		{
		if(str[i11]==f)
			{
        temp11++;l=i11;
      }										
		else{}
		if(temp11>=first){i11=9900;}else{}
		}	
		for(i11=0;i11<(j11-l-1);i11++)
		{
      string[i11] = str[l+i11+1];
		}
	

    }
  }


__inline void fileclose(void)
{
    memset(temp,0,100);
    sprintf(temp,"\r\nAT+QFCLOSE=%s\r\n\r\n",fileinstance);
    SendAT(temp, "+CME ERROR", "OK" , "ERROR",10);
    memset(fileinstance,0,20);
}


void clear()
{char dump = 0;
    while(!UART_GET_RX_EMPTY(UART1)) 
    {
      dump = UART_READ(UART1);
    }
}

__inline void Send_FS(void)
{
  if(sendfs==1){
  TCP_Send_ch("\r\nAT+QISEND\r\n\r\n",g_u8SendData,">","ERROR","SEND OK",5);	
  }
}


void Save_FS(void)
{ char * pch = 0;
  int i,j;
  int len=0;
  
  if(readpt == 0 && pt == 0){
      SpiFlash_WaitReady();
      SpiFlash_ChipErase();
  }
  
  //strcat(g_u8SendData,"\n");
  pch = strstr (g_u8SendData,",L,");
  if (pch){
    strncpy(pch,",H,",3);
  }
  //strreplace(g_u8SendData, 0x1A, '\n'); 
  remove_all_chars(g_u8SendData,'\r',0x1A);
  remove_all_chars(g_u8SendData,'\r','\n');
  SpiFlash_WaitReady();
  life = strlen(g_u8SendData); 
  times = life/256 + 1;
  j = 0;
  while(times > 0){
    //slicing string
    memset(SrcArray,0,257);
    for(i=0;i<256;i++){
      SrcArray[i] = g_u8SendData[j];
      j++;
    }
    manualdelay(50);
    SpiFlash_WaitReady();    
    SpiFlash_PageProgram(SrcArray, pt, 256);
    memset(DestArray,0,257);
    SpiFlash_WaitReady();
    SpiFlash_ReadData(DestArray, pt, 256);
    if(strcmp(SrcArray, DestArray) == 0){
      times--; 
      pt+=256;
    }
  }
  memset(g_u8SendData,0,TXBUFSIZE);
  saveipconfigurations();

}

 void cpinquerry()
{
  int timeout;
	////osDelay(100);  
  //osMutexWait(uart_mutex_id, osWaitForever);
	tmr0sec=0;
	timeout =10;
	r1=0;
	r2=0;
	r3=0;
	g_u8RecDataptr=0;
	memset(g_u8RecData,0,RXBUFSIZE);
	printf("%c",0x1A);
	clear();
	printf("\r\nAT+CPIN?\r\n\r\n");
	do{
    g_u8RecData[0] = '\r';
		r1 = strstr(g_u8RecData, "NOT READY");
		r2 = strstr(g_u8RecData, "OK");
		r3 = strstr(g_u8RecData, "ERROR");
			
	}while(!(r1 || r2 || r3 ||((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
  clear();
 
  if(!strstr(g_u8RecData, "NOT READY"))
  {
    cpinready=1;
  }
  else
  {
    cpinready=0;
  } 
}

void cregquerry()
{
  int timeout;
  
  
  SendAT("\r\nAT+STKTR=\"810301218082028281830100\"\r\n", "+STKPCI: 0", "NAK" , "NAK",2);   //international
  manualdelay(5);
  memset(configdata,0,300);
  parse_g(g_u8RecData,3,4,'"','"',configdata);  
  hextoascii(configdata,strlen(configdata));
  // Switch to international .  You need to give command AT+STKTR="810301240082028281830100900101"  For National Switch
  if(strstr(DestArray,"National(ON)")){
    simselect = 1;
    //SendAT("\r\nAT+COPS=1,2,\"40404\"\r\n", "+STKPCI: 0", "NAK" , "NAK",5);
  }else if(strstr(DestArray,"International(ON)")){
    simselect = 2;
    //SendAT("\r\nAT+COPS=1,2,\"40404\"\r\n", "+STKPCI: 0", "NAK" , "NAK",5);
  }else{
    SendAT("\r\nAT+STKENV=\"D30782020181900101\"\r\n", "+STKPCI: 0", "NAK" , "NAK",5);
    manualdelay(5);
    memset(configdata,0,300);
    parse_g(g_u8RecData,3,4,'"','"',configdata);  
    hextoascii(configdata,strlen(configdata));
    // Switch to international .  You need to give command AT+STKTR="810301240082028281830100900101"  For National Switch
    if(strstr(DestArray,"National(ON)")){
      simselect = 1;
    }else if(strstr(DestArray,"International(ON)")){
      simselect = 2;
    }
  } 
  
  tmr0sec=0;
  timeout =10;
  r1=0;r2=0;r3=0;
  g_u8RecDataptr=0;
  memset(g_u8RecData,0,RXBUFSIZE);
  printf("%c",0x1A);
  clear();
  printf("\r\nAT+CREG=1\r\n");
  do{
  g_u8RecData[0] = '\r';
  r1 = strstr(g_u8RecData, "CPIN: READY");
  r2 = strstr(g_u8RecData, "OK");
  r3 = strstr(g_u8RecData, "ERROR");
  }while(!(r1 || r2 || r3 ||((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
  clear();
	////osDelay(100); 
  //osMutexWait(uart_mutex_id, osWaitForever);
	tmr0sec=0;
	timeout =10;
	r1=0;r2=0;r3=0;
	g_u8RecDataptr=0;
	memset(g_u8RecData,0,RXBUFSIZE);
	printf("%c",0x1A);
	clear();
	printf("\r\nAT+CREG?\r\n");
	do{
    g_u8RecData[0] = '\r';
		r1 = strstr(g_u8RecData, "CPIN: READY");
		r2 = strstr(g_u8RecData, "OK");
		r3 = strstr(g_u8RecData, "ERROR");
	}while(!(r1 || r2 || r3 ||((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
  clear();
  memset(cregresp,0,10);
  parse_g(g_u8RecData, 1, 1, ',', 'O' , cregresp);
  remove_all_chars(cregresp,'\r','\n');
  
  if(strstr(cregresp,"1") || strstr(cregresp, "5"))
  {
    cregready=1;
    cregretry = 0;
  }
  else
  {
    SendAT("\r\nAT+CSQ\r\n", "OK", "NAK" , "NAK",10);
    
    //SendAT("\r\nAT+COPS=?\r\n", "OK", "NAK" , "+CREG: 5",40);

    if(simselect == 1){
      SendAT("\r\nAT+COPS=4,1,\"airtel\"\r\n", "OK", "ERROR" , "+CREG:",50);
    }else if(simselect == 2){
      SendAT("\r\nAT+COPS=4,1,\"IDEA\"\r\n\r\n\r\n", "OK", "NAK" , "+CREG:",50);
    }
    cregready=0;cregretry++;
    if(cregretry >= 5){
      cregretry = 0;
      networkswitch();
    }
  }
 
