mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/at_command.c
}




void SendAT_FS(char * command, char * response1, char * response2, char * response3, int32_t timeout)
{
	tmr0sec=0;
//	timeout =5;
	////osDelay(100);
	r1=0;
	r2=0;
	r3=0;
	g_u8RecDataptr=0;
	memset(g_u8RecData,0,RXBUFSIZE);
//	printf("%c",0x1A);
	clear();
	printf(command);
	do{
		r1 = strstr(g_u8RecData, response1);
		r2 = strstr(g_u8RecData, response2);
		r3 = strstr(g_u8RecData, response3);
	}while(!(r1 || r2 || r3 ||((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
clear();
   if(!strstr(command, "QILOCIP"))
   {
     if(!(r1 || r2 || r3))
      {
        PA13=1;
        printf("\r\n\r\nAT+CFUN=1,1\r\n\r\n");
        manualdelay(100);
        fileclose();
        fileopen();
        SendAT("\r\nAT+QGNSSC=1\r\n\r\n", "OK", "ERROR", "7103", 10);

        PA13=0;
      }
   }
  
////osDelay(10);
}

__inline void strreplace(char s[], char chr, char repl_chr)
{
     int i=0;
     while(s[i]!='\0')
     {
           if(s[i]==chr)
           {
               s[i]=repl_chr;
           }  
           i++; 
     }
}

__inline int count_char(char ch,char* string)
{
int32_t	count=0;
int32_t ass=0;

	for(ass=0;ass<strlen(string);ass++)
	{
		if(string[ass] == ch)
		{count++;}
		
	}
return count;
}

__inline int8_t checkallnumsinstring(char* checkstring)
{
  int returnval, checkstringptr, lencheckstring=0;
  lencheckstring  = strlen(checkstring);
  for(checkstringptr  = 0 ; checkstringptr < lencheckstring ; checkstringptr++)
  {
    if((checkstring[checkstringptr]  > 47 ) && (checkstring[checkstringptr]  < 58 ))
    {returnval  = 0;}
    else
    {returnval  = 1;break;}
  }
  return returnval;
}


void TCP_Send_ch(char * tcpcommand,char * tcpdataq, char * tcpresponse1, char * tcpresponse2, char * tcpresponse3, int32_t tcptimeout)
{
  int tcpdatalength=0;
	int tcpdataptr=0;
	int times = 0;
	int timesptr=0;
	int tdp=0;
	int tdpend=300;
  char chdatalength[5];
  char tcpdata[300];
  int  cc =0;
  breaker = 0;
	PB2=0;
	printf("%c",0x1A);
  tcpsendchtimer = 0;

do{
  memset(tcpdata,0,300);
  SpiFlash_WaitReady();
  SpiFlash_ReadData(tcpdata, readpt, 256);
  outfromloop = readpt;
  if(tcpdata[0] != 0xFF && tcpdata[0] != '\0')
    times = 1;
  else{
        SpiFlash_WaitReady();
        SpiFlash_ChipErase();
        times = 0;
        pt = 0;
        readpt = 0;
        readpt = 0;
        pt = 0; 
        //saveipconfigurations();
    
    //once = 1;
  }
  if(times == 1){
      clear();
      //memset(temp,0,100);
      tmr0sec=0;
      tcptimeout =5;
      r1=0;
      r2=0;
      r3=0;
			g_u8RecDataptr=0;
			tmr0sec=0;
			memset(g_u8RecData,0,RXBUFSIZE);
			printf("\r\nAT+QISEND=0\r\n\r\n\r\n");
			do{
        g_u8RecData[0] = '\r';
				r1 = strstr(g_u8RecData, tcpresponse1);
				r2 = strstr(g_u8RecData, tcpresponse2);
				r3 = strstr(g_u8RecData, tcpresponse3);
					
			}while(!(r1 || r2 || r3 ||((tmr0sec >= tcptimeout))));	 //!(r1 || r2 || r3 ||
      clear();
				tmr0sec=0;
				if(r1)
					{
						tmr0sec=0;
						tcptimeout =5;
						r1=0;
						r2=0;
						r3=0;
						g_u8RecDataptr=0;
						memset(g_u8RecData,0,RXBUFSIZE);
						clear();
 						tcpdataptr=0;
            tdpend=strlen(tcpdata);
   
						for(tdp=0;tdp<tdpend;tdp++)
						{
              SendChar(tcpdata[tdp]);
              tcpdataptr++;
            }
						printf("%c",0x1A);
						do{
              g_u8RecData[0] = '\r';
							r1 = strstr(g_u8RecData, tcpresponse1);
							r2 = strstr(g_u8RecData, tcpresponse2);
							r3 = strstr(g_u8RecData, tcpresponse3);
						}while(!(r1 || r2 || r3 ||((tmr0sec >= tcptimeout))));
          }

			if(!(r3)){
				network=1;
        breaker = 1;        
				break;
			}else{
        breaker = 0;
				network=0;
			}
      
      if(network == 0){    
        
        clear();
        tmr0sec=0;
        tcptimeout =5;
        r1=0;
        r2=0;
        r3=0;
        g_u8RecDataptr=0;
        tmr0sec=0;
        memset(g_u8RecData,0,RXBUFSIZE);
        printf("\r\nAT+QISEND=1\r\n\r\n\r\n");
        do{
          g_u8RecData[0] = '\r';
          r1 = strstr(g_u8RecData, tcpresponse1);
          r2 = strstr(g_u8RecData, tcpresponse2);
          r3 = strstr(g_u8RecData, tcpresponse3);
            
        }while(!(r1 || r2 || r3 ||((tmr0sec >= tcptimeout))));	 //!(r1 || r2 || r3 ||
        clear();
          tmr0sec=0;
          if(r1)
            {
              tmr0sec=0;
              tcptimeout =5;
              r1=0;
              r2=0;
              r3=0;
              g_u8RecDataptr=0;
              memset(g_u8RecData,0,RXBUFSIZE);
              clear();
              tcpdataptr=0;
              tdpend=strlen(tcpdata);
     
              for(tdp=0;tdp<tdpend;tdp++)
              {
                SendChar(tcpdata[tdp]);
                tcpdataptr++;
              }
              printf("%c",0x1A);
              do{
                g_u8RecData[0] = '\r';
                r1 = strstr(g_u8RecData, tcpresponse1);
                r2 = strstr(g_u8RecData, tcpresponse2);
                r3 = strstr(g_u8RecData, tcpresponse3);
              }while(!(r1 || r2 || r3 ||((tmr0sec >= tcptimeout))));
            }

        if(!(r3)){
          network=1;
          breaker = 1;        
          break;
        }else{
          breaker = 0;
          readpt+=256;
          network=0;
        }
      }
      if((tcpsendchtimer > 4) && (strstr(tcpdata, "*"))){
        breaker = 1;
        break;
      }else breaker = 0;
    
    }
  //outfromloop = 1;
  manualdelay(5);
  }while(times == 1);
  if (breaker==1){
    readpt-=512;
  }
  saveipconfigurations();

}



void TCP_Send(char * tcpcommand,char * tcpdata, char * tcpresponse1, char * tcpresponse2, char * tcpresponse3, int32_t tcptimeout)
{
  int network1,network2;
	int tcpdatalength=0;
	int tcpdataptr=0;
	int times = 0;
	int timesptr=0;
	int tdp=0;
	int tdpend=600;

	tmr0sec=0;
	tcptimeout =20;
	r1=0;
	r2=0;
	r3=0;
	g_u8RecDataptr=0;
	printf("%c",0x1A);
	tcpdatalength = strlen(tcpdata);
		if(tcpdatalength>15)
		{
      
			clear();
			g_u8RecDataptr=0;
			tmr0sec=0;
			memset(g_u8RecData,0,RXBUFSIZE);
			printf("\r\nAT+QISEND=0\r\n\r\n\r\n");
			do{
        g_u8RecData[0] = '\r';
				r1 = strstr(g_u8RecData, tcpresponse1);
				r2 = strstr(g_u8RecData, tcpresponse2);
				r3 = strstr(g_u8RecData, tcpresponse3);					
			}while(!(r1 || r2 || r3 ||((tmr0sec >= tcptimeout))));	 //!(r1 || r2 || r3 ||
      clear();
				tmr0sec=0;
				if(r1)
					{
						tmr0sec=0;
						tcptimeout =20;
						r1=0;
						r2=0;
						r3=0;
						g_u8RecDataptr=0;
						memset(g_u8RecData,0,RXBUFSIZE);
						clear();
						for(tdp=0;tdp<tcpdatalength;tdp++){
						SendChar(tcpdata[tcpdataptr]);
						tcpdataptr++;
            }
						printf("%c",0x1A);
						do{
              g_u8RecData[0] = '\r';
							r1 = strstr(g_u8RecData, tcpresponse1);
							r2 = strstr(g_u8RecData, tcpresponse2);
							r3 = strstr(g_u8RecData, tcpresponse3);
						}while(!(r1 || r2 || r3 ||((tmr0sec >= tcptimeout))));
           clear();            
          }
			if(!(r3)){
				network1=1;
        sendfs = 0;
			}
			else{
        notsentcounter= 0;
				network1=0;
        sendfs = 1;        
			}
	}else{//network = 1;
    sendfs = 0;} 
/***********************************************************************************************************************************************/  
  tcpdatalength=0;
  tcpdataptr=0;
  times = 0;
  timesptr=0;
  tdp=0;
  tdpend=600;  
/***********************************************************************************************************************************************/  
  //if(network == 0)
    {  
    tmr0sec=0;
    tcptimeout =20;
    r1=0;
    r2=0;
    r3=0;
    g_u8RecDataptr=0;
    printf("%c",0x1A);
    tcpdatalength = strlen(tcpdata);
      if(tcpdatalength>15)
      {
        clear();
        g_u8RecDataptr=0;
        tmr0sec=0;
        memset(g_u8RecData,0,RXBUFSIZE);
        printf("\r\nAT+QISEND=1\r\n\r\n\r\n");
        do{
          g_u8RecData[0] = '\r';
          r1 = strstr(g_u8RecData, tcpresponse1);
          r2 = strstr(g_u8RecData, tcpresponse2);
          r3 = strstr(g_u8RecData, tcpresponse3);            
        }while(!(r1 || r2 || r3 ||((tmr0sec >= tcptimeout))));	 //!(r1 || r2 || r3 ||
        clear();
          tmr0sec=0;
          if(r1)
            {
              tmr0sec=0;
              tcptimeout =20;
              r1=0;
              r2=0;
              r3=0;
              g_u8RecDataptr=0;
              memset(g_u8RecData,0,RXBUFSIZE);
              clear();
              for(tdp=0;tdp<tcpdatalength;tdp++){
              SendChar(tcpdata[tcpdataptr]);
              tcpdataptr++;
              }
              //to comply with our server
              printf("\n");
              printf("%c",0x1A);
              do{
                g_u8RecData[0] = '\r';
                r1 = strstr(g_u8RecData, tcpresponse1);
                r2 = strstr(g_u8RecData, tcpresponse2);
                r3 = strstr(g_u8RecData, tcpresponse3);
              }while(!(r1 || r2 || r3 ||((tmr0sec >= tcptimeout))));
             clear();           
            }
        if(!(r3)){
          network2=1;
          sendfs = 0;
        }
        else{
          notsentcounter= 0;
          network2=0;
          sendfs = 1;
        }
        
        
    if(network1 & network2 == 1)network = 1;
    if(network1 & network2 == 0){network = 0;notsentcounter = 0;}
        
    if(network == 0 && timesptr>=times){
      if(loginpacket == 1){
        memset(temp,0,100);        
      }else{
        memset(g_u8SendData,0,TXBUFSIZE);
      }
      sendfs=1;
    }
    else{
      sendfs=0;
    }
    }else{//network = 1;
    sendfs = 1;}
  }
  
  if(sendfs == 1){
    memset(configdata,0,300);
    //SpiFlash_WaitReady();
    SpiFlash_ReadData(configdata, readpt, 256);
    if(configdata[0] != 0xFF)
      sendfs = 1;
    else
      sendfs = 0;
  }  
remove_all_chars(g_u8SendData,'\r','\n'); 
}





void SendAT_GPS_WO_MUTEX(char * command, char * response1, char * response2, char * response3, int32_t timeout)
{
//	osMutexWait(uart_mutex_id, osWaitForever);
	////osDelay(500);
	tmr0sec=0;
	r1=0;
	r2=0;
	r3=0;
	g_u8RecDataptr=0;
	memset(g_u8RecData,0,RXBUFSIZE);
	printf("%c",0x1A);
	clear();
	if(checkallnumsinstring(imei) ||  (strlen(imei) < 5))
	{
		printf("\r\nAT+GSN\r\n");
		do{
			r1 = strstr(g_u8RecData, response1);
			r2 = strstr(g_u8RecData, response2);
			r3 = strstr(g_u8RecData, response3);
		}while(!(r1 || r2 || r3 || ((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
		memset(imei,0,25);
		imeiptr0=0;
		for(imeiptr=0;imeiptr<strlen(g_u8RecData);imeiptr++)
		{
			if((g_u8RecData[imeiptr]>47)	&& (g_u8RecData[imeiptr]<58))
			{
				imei[imeiptr0] = g_u8RecData[imeiptr];
				imeiptr0++;
      }
		}
	remove_all_chars(imei, '\r', 0x1a);		
	}
	tmr0sec=0;
	r1=0;
	r2=0;
	r3=0;
	g_u8RecDataptr=0;
	memset(g_u8RecData,0,RXBUFSIZE);
	clear();
	printf("%c",0x1A);
	printf(command);
	do{
		r1 = strstr(g_u8RecData, response1);
		r2 = strstr(g_u8RecData, response2);
		r3 = strstr(g_u8RecData, response3);
	}while(!(r1 || r2 || r3 || ((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
	if(strstr(g_u8RecData,"GNRMC"))
	{
    u32ADC0Result = 3;
    ADC_START_CONV(ADC);
    u32ADC0Result = ADC_GET_CONVERSION_DATA(ADC, 0);
    u32ADC0Result = (3.943/2.097)*((u32ADC0Result*3.312) /4096);
    
