mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/at_command.c
		memset(temp,0,100);
		parse_g(g_u8RecData, 2, 10, 'C', ',' , temp);
		strcat(g_u8SendData,imei);
		strcat(g_u8SendData,",");
		strcat(g_u8SendData,temp);
		memset(temp,0,100);
		sprintf(temp,",F=%.1f",u32ADC0Result);
		strcat(g_u8SendData,temp);
		memset(temp,0,100);
		sprintf(temp,",LIFE=%d\n",life);
		strcat(g_u8SendData,temp);
  }
  if((strlen(g_u8SendData) > 2900))
  {
    memset(g_u8SendData,0,TXBUFSIZE);
    strcat(g_u8SendData,imei);
    strcat(g_u8SendData,"error:RAMfull\n");
  }

  
}

__inline float stof(const char* s)
{int d,point_seen;
  float rez = 0, fact = 1;
  rez=0;fact=1;

  if (*s == '-'){
    s++;
    fact = -1;
  };
  for (point_seen = 0; *s; s++){
    if (*s == '.'){
      point_seen = 1; 
      continue;
    };
    d = *s - '0';
    if (d >= 0 && d <= 9){
      if (point_seen) fact /= 10.0f;
      rez = rez * 10.0f + (float)d;
    };
  };
  return rez * fact;
};  
  



















void SendAT_GPS(char * command, char * response1, char * response2, char * response3, int32_t timeout)
{
  int batterydischarging = 0;

  double d_distance;
  char send_temp[1000] = {0};
  char av[3] = {0};
  char lac1[7] = {0};
  char lac2[7] = {0};
  char lac3[7] = {0};
  char lac4[7] = {0};
  char cellid1[7] = {0};
  char cellid2[7] = {0};
  char cellid3[7] = {0};
  char cellid4[7] = {0};
  char sig1[7] = {0};
  char sig2[7] = {0};
  char sig3[7] = {0};
  char sig4[7] = {0};
  char alert[4] = {0};
  uint32_t checksumdata = 0;
  fix = 0;
  tamperalert = 'C';
  ext_bat, int_bat, lati, longi, speed;
  batteryvoltage = 0;
  inputvoltage = 0;
  memset(send_temp,0,1000);
  memset(latitude,0,12);
  memset(longitude,0,12);

  memset(gpsdate,0,7);
  memset(gpstime,0,7);
  memset(kmph,0,6);
  memset(alt,0,8);
  memset(sat,0,3);
  memset(latdir,0,2);
  memset(longdir,0,2);
  memset(hdop,0,6);
  memset(pdop,0,5);
  memset(networkoperator,0,30);
  memset(mcc,0,5);
  memset(mnc,0,5);
  memset(lac,0,5);
  memset(cellid,0,10);
  memset(nmr,0,200);
  packetstatus = 'L';



    g_u32AdcIntFlag = 0;
    ADC_START_CONV(ADC);   
    while(g_u32AdcIntFlag == 0);
    u32ADC0Result = ADC_GET_CONVERSION_DATA(ADC, 6);
    u32ADC0Result = (2.8/2.8)*((u32ADC0Result*3.299) /4096);
    antennafeedback = u32ADC0Result; 

   // if(antennafeedback > 2.7){
      //internal antenna
    //  PB8 = 1;
  //  }else{
      //external antenna
   //   PB8 = 0;
   // }


//  void SendAT_GPS(char * command, char * response1, char * response2, char * response3, int32_t timeout)
#ifndef OBD
  memset(g_u8SendData,0, TXBUFSIZE);
  SendAT("\r\nAT+QGNSSC=1\r\n\r\n", "OK", "ERROR: 7103" , "OK",5);
  clear();
  SendAT("\r\nAT+CSQ\r\n\r\n", "Ready", "OK" , "ERROR",4);	
  parse_g(g_u8RecData, 1, 1, ' ', ',' , signalquality);	

	tmr0sec=0;
	r1=0;
	r2=0;
	r3=0;
	g_u8RecDataptr=0;
 	clear();
	memset(g_u8RecData,0,RXBUFSIZE);
  printf("\r\n\r\nAT+GSN\r\n\r\n");
  do{
    g_u8RecData[0] = '\r';
    r1 = strstr(g_u8RecData, response1);
    r2 = strstr(g_u8RecData, response2);
    r3 = strstr(g_u8RecData, response3);
  }while(!(r1 || r2 || r3 || ((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
  memset(imei,0,25);
  imeiptr0=0;
  for(imeiptr=0;imeiptr<strlen(g_u8RecData);imeiptr++)
  {
    if((g_u8RecData[imeiptr]>47)	&& (g_u8RecData[imeiptr]<58))
    {
      imei[imeiptr0] = g_u8RecData[imeiptr];
      imeiptr0++;
    }
  }
	remove_all_chars(imei, '\r', 0x1a);		
	
	tmr0sec=0;
	r1=0;
	r2=0;
	r3=0;
	g_u8RecDataptr=0;
	memset(g_u8RecData,0,RXBUFSIZE);
  clear();

	printf("\r\n\r\nAT+QGNSSRD =\"NMEA/RMC\"\r\n\r\n\r\n");
	do{
    g_u8RecData[0] = '\r';
		r1 = strstr(g_u8RecData, response1);
		r2 = strstr(g_u8RecData, response2);
		r3 = strstr(g_u8RecData, response3);
	}while(!(r1 || r2 || r3 || ((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
  clear();
	if(strstr(g_u8RecData,"GNRMC"))
  {  
    memset(temp, 0, 100);
    parse_g(g_u8RecData, 1, 1, '$', '*' , temp);
    parse_g(temp, 1, 1, ',', '.' , gpstime);
    parse_g(temp, 3, 4, ',', ',' , latitude);
    parse_g(temp, 4, 5, ',', ',' , latdir);
    parse_g(temp, 5, 6, ',', ',' , longitude);
    parse_g(temp, 6, 7, ',', ',' , longdir);
    parse_g(temp, 8, 9, ',', ',' , heading);
    parse_g(temp, 9, 10, ',', ',' , gpsdate);
    
		c=atof(latitude);//7523.7412
		hh= c/100; //75
		hh11 = c/100; //75.237412
		mm11 = hh11-hh; //.237412
		mm11*=100;
		mm22=hh+mm11/60;	
		memset(latitude,0,12);
		sprintf(latitude,"%f",mm22);
		c=atof(longitude);//7523.7412
		hh= c/100; //75
		hh11 = c/100; //75.237412
		mm11 = hh11-hh; //.237412
		mm11*=100;
		mm22=hh+mm11/60;	
		memset(longitude,0,12);
		sprintf(longitude,"%f",mm22);	


    if(mm22 != 0){
      fix = 1;
      }else{
      fix = 0;      
    }
    tmr0sec=0;
    r1=0;
    r2=0;
    r3=0;
    g_u8RecDataptr=0;
    memset(g_u8RecData,0,RXBUFSIZE);
    clear();
    printf("\r\n\r\nAT+QGNSSRD=\"NMEA/GGA\"\r\n\r\n\r\n");
    do{
      g_u8RecData[0] = '\r';
      r1 = strstr(g_u8RecData, response1);
      r2 = strstr(g_u8RecData, response2);
      r3 = strstr(g_u8RecData, response3);
    }while(!(r1 || r2 || r3 || ((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
    clear();  

    memset(temp, 0, 100);
    parse_g(g_u8RecData, 1, 1, '$', '*' , temp);
    parse_g(temp, 7, 8, ',', ',' , sat);
    parse_g(temp, 8, 9, ',', ',' , hdop);
    parse_g(temp, 9, 10, ',', ',' , alt);
    
    tmr0sec=0;
    r1=0;
    r2=0;
    r3=0;
    g_u8RecDataptr=0;
    memset(g_u8RecData,0,RXBUFSIZE);
    clear();

    printf("\r\n\r\nAT+QGNSSRD=\"NMEA/VTG\"\r\n\r\n\r\n");
    do{
      g_u8RecData[0] = '\r';
      r1 = strstr(g_u8RecData, response1);
      r2 = strstr(g_u8RecData, response2);
      r3 = strstr(g_u8RecData, response3);
    }while(!(r1 || r2 || r3 || ((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
    clear();  

    memset(temp, 0, 100);
    parse_g(g_u8RecData, 1, 1, '$', '*' , temp);
    parse_g(temp, 7, 8, ',', ',' , kmph);
 
    tmr0sec=0;
    r1=0;
    r2=0;
    r3=0;
    g_u8RecDataptr=0;
    memset(g_u8RecData,0,RXBUFSIZE);
    clear();

    printf("\r\n\r\nAT+QGNSSRD=\"NMEA/GSA\"\r\n\r\n\r\n");
    do{
      g_u8RecData[0] = '\r';
      r1 = strstr(g_u8RecData, response1);
      r2 = strstr(g_u8RecData, response2);
      r3 = strstr(g_u8RecData, response3);
    }while(!(r1 || r2 || r3 || ((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
    clear();  

    memset(temp, 0, 100);
    parse_g(g_u8RecData, 1, 1, '$', '*' , temp);
    parse_g(temp, 15, 16, ',', ',' , pdop);  

    SendAT("\r\nAT+QGNSSRD?\r\n\r\n", "OK", "ERROR: 7103" , "OK",5);

    
    tmr0sec=0;
    r1=0;
    r2=0;
    r3=0;
    g_u8RecDataptr=0;
    memset(g_u8RecData,0,RXBUFSIZE);
    clear();
    printf("\r\n\r\nAT+COPS=0,1,0\r\n\r\n\r\n");
    do{
      g_u8RecData[0] = '\r';
      r1 = strstr(g_u8RecData, response1);
      r2 = strstr(g_u8RecData, response2);
      r3 = strstr(g_u8RecData, response3);
    }while(!(r1 || r2 || r3 || ((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
    clear();  
   
    tmr0sec=0;
    r1=0;
    r2=0;
    r3=0;
    g_u8RecDataptr=0;
    memset(g_u8RecData,0,RXBUFSIZE);
    clear();
    printf("\r\n\r\nAT+COPS?\r\n\r\n\r\n");
    do{
      g_u8RecData[0] = '\r';
      r1 = strstr(g_u8RecData, response1);
      r2 = strstr(g_u8RecData, response2);
      r3 = strstr(g_u8RecData, response3);
    }while(!(r1 || r2 || r3 || ((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
    clear();  

