mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/at_command.c
    parse_g(g_u8RecData, 1,2, '"', '"' , networkoperator);  
    //manualdelay(100);
    
    
    //SendAT("\r\nAT+QENG=2,3\r\n", "null", "null" , "+QENG: 2,",5);
    tmr0sec=0;
    r1=0;
    r2=0;
    r3=0;
    g_u8RecDataptr=0;
    memset(g_u8RecData,0,RXBUFSIZE);
    clear();

    printf("\r\nAT+QENG=2,3\r\n");
    do{
      g_u8RecData[0] = '\r';
      r1 = strstr(g_u8RecData, "NULL");
      r2 = strstr(g_u8RecData, "NULL");
      r3 = strstr(g_u8RecData, "+QENG: 2,");
    }while(!(r1 || r2 || r3 || ((tmr0sec >= 2))));	 //!(r1 || r2 || r3 ||
    clear();  
    
    memset(mcc,0,strlen(mcc));
    memset(mnc,0,strlen(mnc));
    memset(lac,0,strlen(lac));
    memset(cellid,0,strlen(cellid));
    memset(nmr,0,200);
    parse_g(g_u8RecData, 2, 3, ',', ',' , mcc);
    parse_g(g_u8RecData, 3, 4, ',', ',' , mnc);
    parse_g(g_u8RecData, 4, 5, ',', ',' , lac);
    parse_g(g_u8RecData, 5, 6, ',', ',' , cellid);
    parse_g(g_u8RecData, 20, 60, ',', ',' , nmr);
    
//for bihar mines packet compliance    
    strcat(nmr,",");
    memset(lac1,0,7);
    memset(lac2,0,7);
    memset(lac3,0,7);
    memset(lac4,0,7);
    memset(cellid1,0,7);
    memset(cellid2,0,7);
    memset(cellid3,0,7);
    memset(cellid4,0,7);
    memset(sig1,0,7);
    memset(sig2,0,7);
    memset(sig3,0,7);
    memset(sig4,0,7);
    
    parse_g(nmr, 2, 3, ',', ',' , sig1);
    parse_g(nmr, 12, 13, ',', ',' , sig2);
    parse_g(nmr, 22, 23, ',', ',' , sig3);
    parse_g(nmr, 32, 33, ',', ',' , sig4);
    
    parse_g(nmr, 8, 9, ',', ',' , lac1);
    parse_g(nmr, 18, 19, ',', ',' , lac2);
    parse_g(nmr, 28, 29, ',', ',' , lac3);
    parse_g(nmr, 38, 39, ',', ',' , lac4);
    
    parse_g(nmr, 9, 10, ',', ',' , cellid1);
    parse_g(nmr, 19, 20, ',', ',' , cellid2);
    parse_g(nmr, 29, 30, ',', ',' , cellid3);
    parse_g(nmr, 39, 40, ',', ',' , cellid4);    

    memset(nmr,0,200);
    sprintf(nmr,"%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s",lac1,cellid1,sig1,lac2,cellid2,sig2,lac3,cellid3,sig3,lac4,cellid4,sig4);

    /*  
      1,782,-94,56,31,7,404,04,1f5,a25b,2,743,-95,18,26,2,404,04,1f5,a25a,3,780,-102,29,-3,-1000,404,04,090,a715,4,x,x,x,x,x,x,x,x,x,
    */

    tmr0sec=0;
    r1=0;
    r2=0;
    r3=0;
    g_u8RecDataptr=0;
    memset(g_u8RecData,0,RXBUFSIZE);
    clear();    
    printf("\r\n\r\nAT+QENG = 0\r\n\r\n\r\n");
    do{
      g_u8RecData[0] = '\r';
      r1 = strstr(g_u8RecData, "OK");
      r2 = strstr(g_u8RecData, "ERROR");
      r3 = strstr(g_u8RecData, "ËRROR");
    }while(!(r1 || r2 || r3 || ((tmr0sec >= timeout))));	 //!(r1 || r2 || r3 ||
    clear();  
    //PA7 = 1; 
    manualdelay(10);
    packetstatus = 'L';
    g_u32AdcIntFlag = 0;
    ADC_START_CONV(ADC);   
    while(g_u32AdcIntFlag == 0);
    
    u32ADC0Result = ADC_GET_CONVERSION_DATA(ADC, 0);
    u32ADC0Result = (3.712/0.974)*((u32ADC0Result*3.299) /4096);
    batteryvoltage = u32ADC0Result;      
    u32ADC0Result = ADC_GET_CONVERSION_DATA(ADC, 1);
    u32ADC0Result = (12.25/0.875)*((u32ADC0Result*3.299) /4096);
    inputvoltage = u32ADC0Result;
    u32ADC0Result = ADC_GET_CONVERSION_DATA(ADC, 2);
    u32ADC0Result = (12.25/0.875)*((u32ADC0Result*3.299) /4096);
    analog1 = u32ADC0Result;
    u32ADC0Result = ADC_GET_CONVERSION_DATA(ADC, 3);
    u32ADC0Result = (12.25/0.875)*((u32ADC0Result*3.299) /4096);
    analog2 = u32ADC0Result;
    u32ADC0Result = ADC_GET_CONVERSION_DATA(ADC, 4);
    u32ADC0Result = (12.25/0.875)*((u32ADC0Result*3.299) /4096);
    analog3 = u32ADC0Result;
    u32ADC0Result = ADC_GET_CONVERSION_DATA(ADC, 5);
    u32ADC0Result = (12.25/0.875)*((u32ADC0Result*3.299) /4096);
    analog4 = u32ADC0Result;
    //PA7 = 0; 


    input1 = !PA14;
    input2 = !PA15;
    input3 = !PA12;
    input4 = !PA13;
    
    
    
    //Last location saved
    memset(lastlocation,0,50);
    sprintf(lastlocation,"$%s,%s,%s,%s",latitude,latdir,longitude,longdir);
    }
    if((strlen(g_u8SendData) > 2900))
    {
      memset(g_u8SendData,0,TXBUFSIZE);
      strcat(g_u8SendData,imei);
      strcat(g_u8SendData,"error:RAMfull\n");
    }
    //osDelay(5);
  #endif
  #ifdef OBD

  #endif

    memset(alert,0,4);
    strstr(alert, "NR");
    speed = atof(kmph);
    if(speed > overspeed){
      
    }
  if(packetstatus == 'L'){
    alertid = 1; 
  }
//disconnected from external battery
    if(inputvoltage < 5){
      alertid = 3; 
      powerstatus = 0;  
      memset(alert,0,4);
      strstr(alert, "BD");
    }else{
      if(powerstatus == 0){
        memset(alert,0,4);
        strstr(alert, "BR");        
      }
    powerstatus = 1;}  
//internal battery voltage low 
    if(batteryvoltage < batteryvoltagethreshold){
      alertid = 4;
    }   
//if internal battery is charged again    
    if(inputvoltage < 6){
      batterydischarging = 1;     
    } 
//if connected to main batteryvoltage    
    if(speed > overspeed){
      
    }    
//if ignition on triggers
    if(ignition == 1 && ignitionhighlow == 1){
      alertid = 7;
      ignition = 0;
      memset(alert,0,4);
      strstr(alert, "IN");       
    }    
//if ignition off triggers
    if(ignition == 1 && ignitionhighlow == 0){
      alertid = 8;
      ignition = 0;
      memset(alert,0,4);
      strstr(alert, "IF"); 
    }    
  
//if emergency off triggers
    if(emergencystatus == 1 && emergencyhighlow == 0){
      alertid = 11;
      
    }    
//if over the air upgrade requested
    if(parameterupgrade == 1){
      alertid = 12;
      parameterupgrade = 0;
    }        
//if harse braking
   
// if harsh acceleration
   
//if rash turning
    
//if device tampered
//if emergency on triggers
    if(emergencystatus == 1 && emergencyhighlow == 1){
      alertid = 10;
      wetmr = 0;

      //pushemergency = 1;
    }  
    

    if(wetmr > wakeinterval_emer){
      memset(alert,0,4);
      strstr(alert, "EA");   
      emergencystatus = 0;
      pushemergency = 0;
    }else if(emergencystatus == 1){
      alertid = 10;
    }

    if(ignition == 1){
      sleepinterval = sleepinterval_i1;
    }else{
      sleepinterval = sleepinterval_i0;      
    }
    // Live Data packet
    if(interval_count >= sleepinterval)
      {       
      interval_count = 0;
      checksumdata = 0;
      //sprintf(g_u8SendData, "$%s,%s,%s,NR,%c,%s,%s,%d,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%s,%d,%d,%.1f,%.1f,%d,%c,%s,%s,%s,%s,%s,%s\n
      memset(temp,0,100);
      sprintf(temp,"$%s,%s,%s,%s,%.2d,%c,%s,",header,vendorID,firmwareversion,alert,alertid,packetstatus,imei); 
      strcat(g_u8SendData,temp);                                         //$  

      
