mridulp-jft/telecom-gps/vtsOBD-2.0.0 - nuc130/KEIL/at_command.c
      memset(temp,0,100);
      sprintf(temp,"%s,%d,%s,%s,%s,%s,%s,%s,",vehicleregnum,fix,gpsdate,gpstime,latitude,latdir,longitude,longdir);       
      strcat(g_u8SendData,temp);                               //vehicleregnum  

      
      memset(temp,0,100);
      sprintf(temp,"%s,%s,%s,%s,%s,%s,%s,",kmph,heading,sat,alt,pdop,hdop,networkoperator);       
      strcat(g_u8SendData,temp);                               //vehicleregnum      
      
      memset(temp,0,100);
      sprintf(temp,"%d,%d,%.2f,%.2f,%d,%c,",!PB10,powerstatus,inputvoltage,batteryvoltage,!PB9,tamperalert);
      strcat(g_u8SendData,temp);                                        //ignition,powerstatus,inputvoltage,batteryvoltage,emergencystatus,tamperalert

      
      memset(temp,0,100);
      sprintf(temp,"%s,%s,%s,%s,%s,",signalquality,mcc,mnc,lac,cellid);
      strcat(g_u8SendData,temp);           
 
      
      strcat(g_u8SendData,nmr);                                         //nmr  
      strcat(g_u8SendData,",");                                         //,


      memset(temp,0,100);
//      sprintf(temp,"%d%d%d%d,",input1,input2,input3,input4);
//for bihar compliance
      sprintf(temp,"%d,%d,%d,%d,",input1,input2,input3,input4);
      strcat(g_u8SendData,temp);       //,
      input1=input2=input3=input4 = 0;

      memset(temp,0,100);
 //     sprintf(temp,"11,%.6d*",messagecounter++);
//for bihar compliance
      sprintf(temp,"1,1,%.6d,",messagecounter++);   
      strcat(g_u8SendData,temp);                                         //,

      strcat(send_temp,g_u8SendData);
      remove_all_chars(send_temp,'$','*');      
      checksumdata = crc32_fsl(0,send_temp,strlen(send_temp));
      memset(temp,0,100);
      sprintf(temp,"%x*\n",checksumdata);  
      strcat(g_u8SendData,temp);      

    } 
    int_bat_per = (batteryvoltage/4.2) * 100;
    mem_per = (pt/134217728) * 100;
    // Health Monitoring Parameter
    if(interval_count_health >= sleepinterval_health){       
      interval_count_health = 0;
      memset(configdata,0,300);
      sprintf(configdata,"$%s,%s,%s,HP,%s,%.3f,%d,%.3f,%d,%d,%d%d%d%d,%.1f,%.1f",header,vendorID,firmwareversion,imei,int_bat_per,batteryvoltagethreshold,mem_per,sleepinterval_i1,sleepinterval_i0,input1,input2,input3,input4,analog1,analog2);//digital i/o 0000, analog io, *
      strcat(g_u8SendData, configdata);
      remove_all_chars(configdata,'$','*');
      checksumdata = crc32_fsl(0,configdata,strlen(configdata));  
      memset(temp,0,100);
      sprintf(temp,"%x*\n",checksumdata);
      strcat(g_u8SendData,temp);
    }    
    
    //Emergency Alert Packet
    if(emergencystatus == 1){
      memset(configdata,0,300);
      memset(av,0,3);
      d_distance = distance(atof(prevlatitude), atof(prevlongitude), atof(latitude), atof(longitude), 'K');      
      memset(temp,0,100);
      sprintf(temp,"%f,",d_distance);      
      if(fix == 1){
        strcat(av,"A,");                                         //,          
      }else{
        strcat(av,"V,");                                         //,                  
      }     
      memset(configdata,0,300);      
      sprintf(configdata,"$%s,EMR,%s,NM,%s%s,%s,%s,%s,%s,%s,%s,%s,%s,G,%s,%s,%s*",\
      header,imei,gpsdate,gpstime,av,latitude,latdir,longitude,longdir,alt,kmph,temp,vehicleregnum,emernum1,emernum2);
      strcat(g_u8SendData,configdata);
      remove_all_chars(configdata,'$','*');
      checksumdata = crc32_fsl(0,configdata,strlen(configdata)); 
      memset(temp,0,100);
      sprintf(temp,"%x*\n\n\n",checksumdata);
      strcat(g_u8SendData,temp);
    }

remove_all_chars(g_u8SendData,'\r','\n');
//fix = strlen(g_u8SendData);
memset(prevlatitude,0,12);
memset(prevlongitude,0,12);    
strcat(prevlatitude,latitude);
strcat(prevlongitude,longitude);

}